app/controllers/aminet_controller.rb

INSERT INTO `aminets` (`created_at`, `remote_ip`, `updated_at`) VALUES('2010-01-16 20:10:44', NULL, '2010-01-16 20:10:44')
SELECT * FROM `aminets` WHERE (`aminets`.`remote_ip` = '127.0.0.1') LIMIT 1
UPDATE `aminets` SET `updated_at` = '2010-01-16 20:10:44' WHERE `id` = 3
---
  def add
    @remote_ip = request.remote_ip
    Aminet.find_or_create_by_remote_ip(@remote_ip).update_attribute(:updated_at, Time.now)