app/controllers/invoices_controller.rb

  def show
    @invoice=Invoice.find_by_permalink(params[:id])
---
SELECT * FROM `invoices` WHERE (`invoices`.`permalink` = 'N4k7zK5S') LIMIT 1

  def create
    @invoice = Invoice.new(params[:invoice])
    if @invoice.save
---
INSERT INTO `invoices` (`city`, `permalink`, `comment`, `rekvizity`, `fio`, `created_at`, `country`, `summa`, `updated_at`, `count_user`, `phone`, `network_name`, `email`) VALUES(NULL, 'N4k7zK5S', NULL, NULL, '123', '2010-01-23 21:13:12', NULL, NULL, '2010-01-23 21:13:12', NULL, NULL, NULL, NULL)